In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
# 6.1 Identifying Missing Data
# We will use the orders table from Super Store for these tasks
orders = pd.read_csv('./datasets/orders.csv')


# A. Start with some exploratory analysis methods to inspect the data

In [3]:
orders.info ()
# معلومات الجدول

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999991 entries, 0 to 999990
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   order_id     999991 non-null  object
 1   order_date   999991 non-null  object
 2   ship_date    999991 non-null  object
 3   ship_mode    999991 non-null  object
 4   customer_id  999991 non-null  object
 5   product_id   999991 non-null  object
 6   sales        999991 non-null  float64
 7   quantity     999991 non-null  int64
 8   discount     999991 non-null  float64
 9   profit       999991 non-null  float64
 10  postal_code  192888 non-null  float64
 11  region_id    999795 non-null  float64
dtypes: float64(5), int64(1), object(6)
memory usage: 91.6+ MB

In [4]:
orders.isnull()
#هنا نشوف البيانات المفقودة

,order_id,order_date,ship_date,ship_mode,customer_id,product_id,sales,quantity,discount,profit,postal_code,region_id
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
999986,False,False,False,False,False,False,False,False,False,False,True,False
999987,False,False,False,False,False,False,False,False,False,False,True,False
999988,False,False,False,False,False,False,False,False,False,False,True,False
999989,False,False,False,False,False,False,False,False,False,False,True,False
999990,False,False,False,False,False,False,False,False,False,False,False,False

In [5]:
# B. Which column has the most missing data? Sort the columns by sum of null values

In [6]:
orders.isnull().sum()
# هنا نجمع البيانات المفقودة
# ونقدر نسويها على عمود واحد

order_id            0
order_date          0
ship_date           0
ship_mode           0
customer_id         0
product_id          0
sales               0
quantity            0
discount            0
profit              0
postal_code    807103
region_id         196
dtype: int64

In [7]:
orders['postal_code']= orders['postal_code'].dropna(inplace = True)
#هنا يبدل العمود بعمود تاني  ونحذف النل و نبدلها ب نون 
#عشان  نقدر نحذفها

In [8]:
orders.isnull().sum()

order_id            0
order_date          0
ship_date           0
ship_mode           0
customer_id         0
product_id          0
sales               0
quantity            0
discount            0
profit              0
postal_code    999991
region_id         196
dtype: int64

In [8]:
# C. Looks like postal_code is our biggest problem, along with region_id
# Use a combination of filtering, isnull, and sum to count how many rows are missing both columns

In [12]:
orders[['postal_code','region_id']].isnull().sum()

postal_code    807103
region_id         196
dtype: int64

In [52]:
orders[orders['postal_code'].isnull()]['region_id'].isnull().sum()
#هنا جمع المفقودة في كود وحاد بحيث يحسب بس الي فيها معلومات مفقودة في العمودين

196

In [13]:
orders.postal_code.isnull().sum()

807103

In [ ]:
# D. Let's drop the region_id nulls from the dataframe before proceeding

In [43]:
orders_new= orders.dropna(subset=['region_id'])
# سوينا داتا جديدة عشان نحفظ فيها التغيرات الي سويناهاا 
# ودي هي الطريقة الافضل من الاولى عشان ما نغير في الداتا لااصلية

In [40]:
orders.info()
# هنا البيانات القديمة  و زي ما نشوف البوستال كود سار مافيه  نل لانه حولناه الى نن

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999991 entries, 0 to 999990
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   order_id     999991 non-null  object
 1   order_date   999991 non-null  object
 2   ship_date    999991 non-null  object
 3   ship_mode    999991 non-null  object
 4   customer_id  999991 non-null  object
 5   product_id   999991 non-null  object
 6   sales        999991 non-null  float64
 7   quantity     999991 non-null  int64
 8   discount     999991 non-null  float64
 9   profit       999991 non-null  float64
 10  postal_code  192888 non-null  float64
 11  region_id    999795 non-null  float64
dtypes: float64(5), int64(1), object(6)
memory usage: 91.6+ MB

In [16]:
orders['region_id'].dropna().isnull().sum()
# هنا بنعد الي مافيها بيانات

0

In [53]:
orders_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 999795 entries, 0 to 999990
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   order_id     999795 non-null  object
 1   order_date   999795 non-null  object
 2   ship_date    999795 non-null  object
 3   ship_mode    999795 non-null  object
 4   customer_id  999795 non-null  object
 5   product_id   999795 non-null  object
 6   sales        999795 non-null  float64
 7   quantity     999795 non-null  int64
 8   discount     999795 non-null  float64
 9   profit       999795 non-null  float64
 10  postal_code  192888 non-null  float64
 11  region_id    999795 non-null  float64
dtypes: float64(5), int64(1), object(6)
memory usage: 99.2+ MB

In [47]:
orders_new.isnull().sum()
# هنا البيانات الجديدة  بعد ما حذفنا الصفوف الي كان فيها نل اول

order_id            0
order_date          0
ship_date           0
ship_mode           0
customer_id         0
product_id          0
sales               0
quantity            0
discount            0
profit              0
postal_code    806907
region_id           0
dtype: int64

In [49]:
# E. It's the dream scenario! The IT team confirms all missing postal_code values should be 10001.0
new_orders_po = orders.fillna('10001.0')

In [50]:
new_orders_po.isnull().sum()
# هنا البيانات الجديدة  بعد ما حذفنا الصفوف الي كان فيها نل اول

order_id       0
order_date     0
ship_date      0
ship_mode      0
customer_id    0
product_id     0
sales          0
quantity       0
discount       0
profit         0
postal_code    0
region_id      0
dtype: int64

In [51]:
orders['region_id'].fillna('unknown')
# هنا نستبدل البيانات المفقودة بكلمة

0          9954
1          4792
2         19848
3          1410
4          1826
          ...
999986     3210
999987     3539
999988     3855
999989      783
999990     1488
Name: region_id, Length: 999991, dtype: object

In [52]:
orders.fillna({'postal_code': 0})
# طريقة تانية نستبدل فيها البيانات المفقودة و كلهم صح  
#دي الطريقة نسوي طريقة الدكشنري

,order_id,order_date,ship_date,ship_mode,customer_id,product_id,sales,quantity,discount,profit,postal_code,region_id,new_postal_code
0,AE-2016-1308551,2016-09-28,2016-10-02,Second Class,PO-8865,OFF-FEL-10001405,82.67,2,0.30,0.30,0,9954.0,NaN
1,AE-2016-1522857,2016-09-04,2016-09-09,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.50,0.50,0,4792.0,NaN
2,AE-2016-184765,2016-10-03,2016-10-07,Second Class,PO-8865,OFF-FEL-10001405,82.67,2,0.30,0.30,0,19848.0,NaN
3,AE-2016-1878215,2016-09-15,2016-09-17,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.50,0.50,0,1410.0,NaN
4,AE-2016-218276,2016-10-09,2016-10-12,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.50,0.50,0,1826.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
999986,ZI-2020-495856,2020-01-04,2020-01-09,Second Class,JC-5775,OFF-AVE-10000543,1.16,1,0.17,0.09,0,3210.0,NaN
999987,ZI-2020-5409624,2020-01-13,2020-01-18,Second Class,JC-5775,OFF-AVE-10000543,1.16,1,0.17,0.09,0,3539.0,NaN
999988,ZI-2020-5478741,2020-01-10,2020-01-10,Standard Class,JC-5775,TEC-KON-10003116,71.64,2,0.32,0.23,0,3855.0,NaN
999989,ZI-2020-5986855,2020-01-08,2020-01-11,Standard Class,JC-5775,TEC-KON-10003116,71.64,2,0.32,0.23,0,783.0,NaN
999990,ZI-2020-863102,2020-01-22,2020-01-27,Standard Class,JM-5250,FUR-SAF-10002314,49.65,1,0.22,0.14,0,1488.0,77095.0

In [56]:
orders['region_id'].fillna(orders.region_id.median())

0          9954.0
1          4792.0
2         19848.0
3          1410.0
4          1826.0
           ...
999986     3210.0
999987     3539.0
999988     3855.0
999989      783.0
999990     1488.0
Name: region_id, Length: 999991, dtype: float64

In [54]:
orders.region_id.mean()
#نشوف المين والميدان عشان نقرر مين الي نحطه 
#اذا المين كبير استخدمي الميدين لانه مايتأثر بالقيم المتطرفه مثل المين

6370.559012597582

In [55]:
orders.region_id.median()

3688.0

In [ ]:
orders['ship_mode'].replace('second class' , 'secondclass')
# هنا غيرنا المدخلات من اسم كامل الى اختصار

In [60]:
orders['days_to_ship']= pd.to_datetime(orders.ship_date) - (orders.order_date)
# سوينا عمود جديد يحسب لنا الاياام من الطلب الى الشحن

In [62]:
orders['order_date']= pd.to_datetime(orders.order_date)
# حولنا التاريخ من كلام الى صيغة تاريخ

In [63]:
orders.order_date.dt.month 
# هنا نستخرج الشهر 
ولا

0          9
1          9
2         10
3          9
4         10
          ..
999986     1
999987     1
999988     1
999989     1
999990     1
Name: order_date, Length: 999991, dtype: int64

In [65]:
orders['day'] = orders.order_date.dt.day
# هنا نستخرج اليوم ونحطه في عمود لحاله

In [66]:
# في حال نبغى نغير في العمود كامل ح نكتب فنكشن 
def remove_spaces(str):
    return str.replace(" ", "")
# بعد ما كتبنا الفنكشن نسوي استبدال العمود القديم بالعمود الجديد
orders['ship_mode'] = orders['ship_mode'].apply(remove_spaces)

In [67]:
orders.head()

,order_id,order_date,ship_date,ship_mode,customer_id,product_id,sales,quantity,discount,profit,postal_code,region_id,days_to_ship,day
0,AE-2016-1308551,2016-09-28,2016-10-02,SecondClass,PO-8865,OFF-FEL-10001405,82.67,2,0.3,0.3,NaN,9954.0,4 days,28
1,AE-2016-1522857,2016-09-04,2016-09-09,StandardClass,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,4792.0,5 days,4
2,AE-2016-184765,2016-10-03,2016-10-07,SecondClass,PO-8865,OFF-FEL-10001405,82.67,2,0.3,0.3,NaN,19848.0,4 days,3
3,AE-2016-1878215,2016-09-15,2016-09-17,StandardClass,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,1410.0,2 days,15
4,AE-2016-218276,2016-10-09,2016-10-12,StandardClass,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,NaN,1826.0,3 days,9

In [16]:
# 6.2 Cleaning Our Data
# A. Write a profit_margin function that accepts a row of data, which is a dictionary
#    It should return the result of dividing the profit column by the sales column (i.e. profit/sales)

dic = {'sales':[orders.sales],'profit':[orders.profit]}
# سوينا دكشنري و عرفنا فيه الكي الي هي عناوين و الفاليو ح تكون الاعمدة

In [17]:
def function(row):
    return row["profit"] / row["sales"]

In [18]:
# B. Create a new column in the orders dataframe called 'profit_margin' by applying the profit margin function row-by-row

In [19]:
orders['profit_margin'] = orders.apply(function, axis=1)
# الاكسيس عشان يطبق الفنكشن على العمود كامل و الا ح يطبقها على صف واحد

In [20]:
# C. Use the same process to create a new column called margin_category
# If the profit_margin is less than 0, the margin_category should be "unprofitable"
# If the profit_margin is 0, the margin_category should be "break even"
# If the profit_margin is above 0, the margin_category should "profitable"

In [ ]:
# If the profit_margin is less than 0, the margin_category should be "unprofitable"
orders.loc[orders['profit_margin'] < 0, 'margin_category'] = "unprofitable" 
# If the profit_margin is 0, the margin_category should be "break even"
orders.loc[orders['profit_margin'] == 0 , 'margin_category'] = "break even" 
# If the profit_margin is above 0, the margin_category should "profitable"
orders.loc[orders['profit_margin'] > 0 , 'margin_category'] = "profitable"  
orders.head(3)

In [21]:
def margin_category(profit_margin):
        if profit_margin < 0:
            return "unprofitable"
        elif profit_margin ==0:
            return "break even"
        else:
            return  "profitable"

In [24]:
orders['margin_category']=orders['profit_margin'].apply(margin_category)

In [ ]:
orders['margin_category']=orders['profit_margin'].apply(margin_category)

In [25]:
orders.head()

,order_id,order_date,ship_date,ship_mode,customer_id,product_id,sales,quantity,discount,profit,postal_code,region_id,profit_margin,margin_category
0,AE-2016-1308551,2016-09-28,2016-10-02,Second Class,PO-8865,OFF-FEL-10001405,82.67,2,0.3,0.3,None,9954.0,0.003629,profitable
1,AE-2016-1522857,2016-09-04,2016-09-09,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,None,4792.0,0.006377,profitable
2,AE-2016-184765,2016-10-03,2016-10-07,Second Class,PO-8865,OFF-FEL-10001405,82.67,2,0.3,0.3,None,19848.0,0.003629,profitable
3,AE-2016-1878215,2016-09-15,2016-09-17,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,None,1410.0,0.006377,profitable
4,AE-2016-218276,2016-10-09,2016-10-12,Standard Class,PO-8865,TEC-EPS-10004171,78.41,6,0.5,0.5,None,1826.0,0.006377,profitable

In [ ]:
# D. How many of our orders were unprofitable?

In [30]:
orders["margin_category"].value_counts()

profitable      876500
break even      110952
unprofitable     12539
Name: margin_category, dtype: int64

In [36]:
orders.query("margin_category=='unprofitable'").shape[0]

12539

In [34]:
orders[orders['margin_category']=='unprofitable'].shape[0]
# هنا وظيفة الشيب ح يطلع النتيجة الي هي عدد الصفوف

12539

In [ ]:
# 6.3 GroupBy Insights
# Segment the following data and explore aggregate values to answer the following questions

In [40]:
orders.groupby(['ship_mode', 'customer_id'])['sales'].mean()

ship_mode       customer_id
First Class     AA-10315        99.398333
                AA-10375       132.702000
                AA-10480        65.943667
                AA-10645        84.380946
                AA-315           4.500000
                                  ...
Standard Class  YS-21880       441.962017
                ZC-11910         7.170000
                ZC-21910       441.727853
                ZD-11925       226.740080
                ZD-21925       313.598942
Name: sales, Length: 6040, dtype: float64

In [58]:
orders.groupby(['ship_mode'])['sales'].agg(['count','mean','min','max'])

                 count        mean   min       max
ship_mode
First Class      52655   93.876810  0.98  13999.96
Same Day        206222   61.410539  0.56   8187.65
Second Class    335758  227.750184  0.56   9892.74
Standard Class  405356  374.503994  0.44  22638.48

In [76]:
# A. Which discount results in the highest mean order quantity?
orders.groupby('discount')['quantity'].mean().sort_values(ascending =False).iloc[[0]].index[0]

# هنا عملنا قروب للديسكاونت 
# و نبغى لمتوسط للكونانتيتي 
# السورت فاليو عشان نطلعها بالترتيب و نختار فولز عشان يكون بالاكبر 
#الاي لوك عشان ندخل جوا الجدول ف حي طلع لنا الصف الاول
# الاندكس 0 معناه اول خلية 
# الاقواس المربعة عشان يطلعها داتافريم والا ما ح يطلع من دونها و يكون غلط

0.63

In [77]:
# B. Which product has the highest mean price discount applied?
orders.groupby('product_id')['discount'].mean().sort_values(ascending =False).iloc[[0]].index[0]

'OFF-AP-10002899'

In [69]:
orders.groupby('product_id')['discount'].agg(['mean', 'max'])

                      mean   max
product_id
FUR-ADV-10000002  0.205147  0.35
FUR-ADV-10000108  0.066522  0.07
FUR-ADV-10000183  0.240765  0.35
FUR-ADV-10000188  0.235196  0.35
FUR-ADV-10000190  0.300000  0.30
...                    ...   ...
TEC-STA-10004181  0.393095  0.55
TEC-STA-10004536  0.445783  0.57
TEC-STA-10004542  0.355833  0.55
TEC-STA-10004834  0.333750  0.50
TEC-STA-10004927  0.500000  0.50

[10292 rows x 2 columns]

In [ ]:
# 6.4 Joining DataFrames
# The below example joins our first two dataframes by their shared column, Symbol
openprice = pd.DataFrame({'Symbol': ['AAPL', 'DHR', 'DAL', 'AMZN'], 'OpenPrice': [217.51, 96.54, 51.45, 1703.34]})
wkhigh = pd.DataFrame({'Symbol': ['DAL', 'AMZN', 'AAPL', 'DHR'], '52wkHigh': [60.79, 2050.49, 233.47, 110.11]})
combined = pd.merge(openprice, wkhigh, how="left", left_on='Symbol', right_on='Symbol')
combined.head()

In [ ]:
# A. Join the stockname dataframe to our combined result and print the result
stockname = pd.DataFrame({'Symbol': ['AMZN', 'DHR', 'DAL', 'AAPL'], 'Name': ['Amazon', 'Danaher', 'Delta Airlines', 'Apple']})

In [ ]:
# B. Use the following tables from Super Store
products = pd.read_csv('./datasets/products.csv')
orders = pd.read_csv('./datasets/orders.csv')
returns = pd.read_csv('./datasets/returns.csv')
regions = pd.read_csv('./datasets/regions.csv')

In [ ]:
# i. We want to join the products and orders dataframes. 
#    Explore both dataframes to identify the common column between them
#    Use a left join to combine the tables in a dataframe named orders_with_products

In [ ]:
# ii. Left join the orders_with_products and returns dataframes

In [ ]:
# iii. Finally, add the region data to our combined dataframe

In [ ]:
# iv. Let's use this combined dataframe to determine the salesperson generating the most profit